# Pandas in depth
---
Pandas is an open source data analysi library written in python. It leverages the power and speed to make data analysis and prepocessing easy for data scienctists. It provides rich and highly robust data operations

#### Pandas has two types of data strcuture
1. Series - Its a one dimensional array with indexes, it stores a single column or row of data in a Dataframe.
2. Dataframe - Its a tabular spreadsheet like structure represnting rows each of which contains one or multiple columns

In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name": ['Shreeja', 'Abcd' ,'Efgh', 'Hijk'],
    "marks": [98, 43, 54, 37],
     "city": ['Pune', 'Mumbai', 'Dubai', 'Nyc']
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

      name  marks    city
0  Shreeja     98    Pune
1     Abcd     43  Mumbai
2     Efgh     54   Dubai
3     Hijk     37     Nyc

In [6]:
df.to_csv('Friends.csv')

In [7]:
df.to_csv('Friends_index_false.csv' , index=False)

In [8]:
df.head

<bound method NDFrame.head of       name  marks    city
0  Shreeja     98    Pune
1     Abcd     43  Mumbai
2     Efgh     54   Dubai
3     Hijk     37     Nyc>

In [9]:
df.head(2)

      name  marks    city
0  Shreeja     98    Pune
1     Abcd     43  Mumbai

In [10]:
df.tail(2)

   name  marks   city
2  Efgh     54  Dubai
3  Hijk     37    Nyc

In [11]:
df.describe()

           marks
count   4.000000
mean   58.000000
std    27.580186
min    37.000000
25%    41.500000
50%    48.500000
75%    65.000000
max    98.000000

In [27]:
shreeja = pd.read_csv('shreeja.csv')

In [28]:
shreeja

   Unnamed: 0  Number     name  marks    city
0           0       0  Shreeja     87    Pune
1           1       1     Abcd     43  Mumbai
2           2       2     Efgh     54   Dubai
3           3       3     Hijk     37     Nyc

In [33]:
shreeja['marks'][0] = 58

C:\Users\SURESH\AppData\Local\Temp\ipykernel_10260\2758830902.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  shreeja['marks'][0] = 58
C:\Users\SURESH\AppData\Local\Temp\ipykernel_10260\2758830902.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  shreeja['marks'][0] = 58

shreeja

In [34]:
shreeja.to_csv('shreeja.csv')

In [35]:
shreeja.index = [ 'first', 'second', 'third' , 'fourth']

In [36]:
shreeja

        Unnamed: 0  Number     name  marks    city
first            0       0  Shreeja     58    Pune
second           1       1     Abcd     43  Mumbai
third            2       2     Efgh     54   Dubai
fourth           3       3     Hijk     37     Nyc

In [37]:
shreeja.to_csv('shreeja.csv')

In [38]:
ser = pd.Series(np.random.rand)

In [40]:
type(ser)

pandas.core.series.Series

### Making a new dataframe

In [42]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [43]:
newdf.head()

          0         1         2         3         4
0  0.989518  0.926625  0.562731  0.047657  0.925934
1  0.879604  0.150567  0.676038  0.293011  0.367460
2  0.200450  0.935482  0.486539  0.127415  0.351954
3  0.787550  0.678246  0.070760  0.858292  0.436208
4  0.272331  0.988493  0.327276  0.108461  0.823693

In [48]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.989518  0.926625  0.562731  0.047657  0.925934
1  0.879604  0.150567  0.676038  0.293011  0.367460
2  0.200450  0.935482  0.486539  0.127415  0.351954
3  0.787550  0.678246  0.070760  0.858292  0.436208
4  0.272331  0.988493  0.327276  0.108461  0.823693

In [45]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.491817    0.500812    0.464002    0.498248    0.521132
std      0.294307    0.292683    0.287423    0.295675    0.269118
min      0.001354    0.014714    0.000674    0.001802    0.006539
25%      0.218733    0.240008    0.217761    0.267874    0.311144
50%      0.491224    0.494770    0.466406    0.492698    0.522100
75%      0.740546    0.747179    0.691733    0.752219    0.735054
max      0.994050    0.999817    0.996372    0.999608    0.991822

In [46]:
newdf.dtypes   #datatypes in df

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [49]:
newdf[0][0] = "shreeja"

C:\Users\SURESH\AppData\Local\Temp\ipykernel_10260\4072895907.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'shreeja' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "shreeja"

In [50]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [53]:
newdf.head()

          0         1         2         3         4
0   shreeja  0.926625  0.562731  0.047657  0.925934
1  0.879604  0.150567  0.676038  0.293011  0.367460
2   0.20045  0.935482  0.486539  0.127415  0.351954
3   0.78755  0.678246  0.070760  0.858292  0.436208
4  0.272331  0.988493  0.327276  0.108461  0.823693

In [56]:
newdf.index       #rows in df

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [55]:
newdf.columns         #column in df

RangeIndex(start=0, stop=5, step=1)

In [57]:
newdf.to_numpy()

array([['shreeja', 0.9266254917490268, 0.5627313343562813,
        0.047656671163891606, 0.9259343347362886],
       [0.8796041556809322, 0.15056683181590558, 0.6760379496400541,
        0.2930111250567716, 0.3674597287401361],
       [0.20045011350606423, 0.935482235032856, 0.48653909803180784,
        0.12741518870207402, 0.3519544638050519],
       ...,
       [0.21072453117077905, 0.7081009121828282, 0.8085605797290341,
        0.015494432575372086, 0.011793555830080904],
       [0.46638634427187065, 0.8566958325875402, 0.9481027882561447,
        0.20902753481384684, 0.296817801469889],
       [0.734858607331554, 0.8984016578228687, 0.06344636667879477,
        0.5669078747377765, 0.4123178422737829]], dtype=object)

### Transposing the dataframe

In [58]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,shreeja,0.879604,0.20045,0.78755,0.272331,0.464065,0.488756,0.948841,0.70957,0.523639,...,0.322393,0.773235,0.258789,0.526956,0.065837,0.525054,0.425634,0.210725,0.466386,0.734859
1,0.926625,0.150567,0.935482,0.678246,0.988493,0.680409,0.152628,0.832616,0.348346,0.340233,...,0.08383,0.283552,0.445256,0.939534,0.391498,0.247587,0.862098,0.708101,0.856696,0.898402
2,0.562731,0.676038,0.486539,0.07076,0.327276,0.780612,0.374634,0.904179,0.094909,0.625566,...,0.570253,0.789981,0.960114,0.961385,0.183307,0.767044,0.188668,0.808561,0.948103,0.063446
3,0.047657,0.293011,0.127415,0.858292,0.108461,0.403326,0.430259,0.015723,0.089396,0.440576,...,0.945819,0.303503,0.666058,0.148971,0.758901,0.007834,0.986786,0.015494,0.209028,0.566908
4,0.925934,0.36746,0.351954,0.436208,0.823693,0.676171,0.358971,0.247559,0.398113,0.218281,...,0.090229,0.943244,0.936395,0.255577,0.704675,0.595594,0.284202,0.011794,0.296818,0.412318

Therefore now this df has 5 rows and 334 columns.